; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v12 ?v3)
             (pred_9 ?v7 ?v1)
             (pred_2 ?v12 ?v1)
             (pred_10 ?v9 ?v12 )
	     (pred_7 ?v12)
             (pred_5 ?v8)
             (pred_11 ?v7)
             (pred_6 ?v1)
             (pred_4 ?v12)
             (pred_8 ?v7)
             (pred_3 ?v12)
             (pred_1 ))



(:action op_1
:parameters (?v11 ?v5 ?v2 ?v10)
:precondition (and (pred_5 ?v11) (pred_5 ?v5) (pred_11 ?v2) (pred_6 ?v10)
          (pred_12 ?v11 ?v5) (pred_9 ?v2 ?v10)
                   (pred_2 ?v5 ?v10) (pred_7 ?v11) 
                   (pred_4 ?v5) (pred_8 ?v2))
:effect (and  (pred_3 ?v5) (not (pred_4 ?v5))))


(:action op_3
:parameters (?v11 ?v13)
:precondition (and (pred_5 ?v11) (pred_5 ?v13)
               (pred_7 ?v11) (pred_12 ?v11 ?v13) (pred_3 ?v13))
:effect (and (pred_7 ?v13) (not (pred_7 ?v11))))

(:action op_5
:parameters (?v11 ?v2)
:precondition (and (pred_5 ?v11) (pred_11 ?v2) 
                  (pred_7 ?v11) (pred_10 ?v2 ?v11) (pred_1 ))
:effect (and (pred_8 ?v2)
   (not (pred_10 ?v2 ?v11)) (not (pred_1 ))))


(:action op_4
:parameters (?v11 ?v6 ?v4)
:precondition (and (pred_5 ?v11) (pred_11 ?v6) (pred_11 ?v4)
                  (pred_7 ?v11) (pred_8 ?v4) (pred_10 ?v6 ?v11))
:effect (and (pred_8 ?v6) (pred_10 ?v4 ?v11)
        (not (pred_8 ?v4)) (not (pred_10 ?v6 ?v11))))

(:action op_2
:parameters (?v11 ?v2)
:precondition (and (pred_5 ?v11) (pred_11 ?v2) 
                  (pred_7 ?v11) (pred_8 ?v2))
:effect (and (pred_1 ) (pred_10 ?v2 ?v11) (not (pred_8 ?v2)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_23 obj_30 obj_02 obj_05 obj_08 obj_20 obj_22 obj_04 obj_24 obj_29 obj_13 obj_11 obj_25 obj_21 obj_09 obj_19 obj_16 obj_12 obj_17 obj_31 obj_18 obj_06 obj_01 obj_26 obj_27
    obj_10 obj_28 obj_15
    obj_03 obj_32 obj_14 obj_07
    )

    (:init
       (pred_1)

       (pred_5 obj_23)
       (pred_5 obj_30)
       (pred_5 obj_02)
       (pred_5 obj_05)
       (pred_5 obj_08)
       (pred_5 obj_20)
       (pred_5 obj_22)
       (pred_5 obj_04)
       (pred_5 obj_24)
       (pred_5 obj_29)
       (pred_5 obj_13)
       (pred_5 obj_11)
       (pred_5 obj_25)
       (pred_5 obj_21)
       (pred_5 obj_09)
       (pred_5 obj_19)
       (pred_5 obj_16)
       (pred_5 obj_12)
       (pred_5 obj_17)
       (pred_5 obj_31)
       (pred_5 obj_18)
       (pred_5 obj_06)
       (pred_5 obj_01)
       (pred_5 obj_26)
       (pred_5 obj_27)
       (pred_6 obj_10)
       (pred_6 obj_28)
       (pred_6 obj_15)
       (pred_11 obj_03)
       (pred_11 obj_32)
       (pred_11 obj_14)
       (pred_11 obj_07)

       (pred_12 obj_23 obj_20)
       (pred_12 obj_23 obj_30)
       (pred_12 obj_30 obj_22)
       (pred_12 obj_30 obj_02)
       (pred_12 obj_30 obj_23)
       (pred_12 obj_02 obj_04)
       (pred_12 obj_02 obj_05)
       (pred_12 obj_02 obj_30)
       (pred_12 obj_05 obj_24)
       (pred_12 obj_05 obj_08)
       (pred_12 obj_05 obj_02)
       (pred_12 obj_08 obj_29)
       (pred_12 obj_08 obj_05)
       (pred_12 obj_20 obj_13)
       (pred_12 obj_20 obj_22)
       (pred_12 obj_20 obj_23)
       (pred_12 obj_22 obj_11)
       (pred_12 obj_22 obj_04)
       (pred_12 obj_22 obj_30)
       (pred_12 obj_22 obj_20)
       (pred_12 obj_04 obj_25)
       (pred_12 obj_04 obj_24)
       (pred_12 obj_04 obj_02)
       (pred_12 obj_04 obj_22)
       (pred_12 obj_24 obj_21)
       (pred_12 obj_24 obj_29)
       (pred_12 obj_24 obj_05)
       (pred_12 obj_24 obj_04)
       (pred_12 obj_29 obj_09)
       (pred_12 obj_29 obj_08)
       (pred_12 obj_29 obj_24)
       (pred_12 obj_13 obj_19)
       (pred_12 obj_13 obj_11)
       (pred_12 obj_13 obj_20)
       (pred_12 obj_11 obj_16)
       (pred_12 obj_11 obj_25)
       (pred_12 obj_11 obj_22)
       (pred_12 obj_11 obj_13)
       (pred_12 obj_25 obj_12)
       (pred_12 obj_25 obj_21)
       (pred_12 obj_25 obj_04)
       (pred_12 obj_25 obj_11)
       (pred_12 obj_21 obj_17)
       (pred_12 obj_21 obj_09)
       (pred_12 obj_21 obj_24)
       (pred_12 obj_21 obj_25)
       (pred_12 obj_09 obj_31)
       (pred_12 obj_09 obj_29)
       (pred_12 obj_09 obj_21)
       (pred_12 obj_19 obj_18)
       (pred_12 obj_19 obj_16)
       (pred_12 obj_19 obj_13)
       (pred_12 obj_16 obj_06)
       (pred_12 obj_16 obj_12)
       (pred_12 obj_16 obj_11)
       (pred_12 obj_16 obj_19)
       (pred_12 obj_12 obj_01)
       (pred_12 obj_12 obj_17)
       (pred_12 obj_12 obj_25)
       (pred_12 obj_12 obj_16)
       (pred_12 obj_17 obj_26)
       (pred_12 obj_17 obj_31)
       (pred_12 obj_17 obj_21)
       (pred_12 obj_17 obj_12)
       (pred_12 obj_31 obj_27)
       (pred_12 obj_31 obj_09)
       (pred_12 obj_31 obj_17)
       (pred_12 obj_18 obj_06)
       (pred_12 obj_18 obj_19)
       (pred_12 obj_06 obj_01)
       (pred_12 obj_06 obj_16)
       (pred_12 obj_06 obj_18)
       (pred_12 obj_01 obj_26)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_01 obj_06)
       (pred_12 obj_26 obj_27)
       (pred_12 obj_26 obj_17)
       (pred_12 obj_26 obj_01)
       (pred_12 obj_27 obj_31)
       (pred_12 obj_27 obj_26)
       (pred_4 obj_08)
       (pred_4 obj_27)
       (pred_4 obj_11)
       (pred_4 obj_09)
       (pred_2  obj_08 obj_10)
       (pred_2  obj_27 obj_28)
       (pred_2  obj_11 obj_15)
       (pred_2  obj_09 obj_28)
       (pred_3 obj_23)
       (pred_3 obj_30)
       (pred_3 obj_02)
       (pred_3 obj_05)
       (pred_3 obj_20)
       (pred_3 obj_22)
       (pred_3 obj_04)
       (pred_3 obj_24)
       (pred_3 obj_29)
       (pred_3 obj_13)
       (pred_3 obj_25)
       (pred_3 obj_21)
       (pred_3 obj_19)
       (pred_3 obj_16)
       (pred_3 obj_12)
       (pred_3 obj_17)
       (pred_3 obj_31)
       (pred_3 obj_18)
       (pred_3 obj_06)
       (pred_3 obj_01)
       (pred_3 obj_26)

       (pred_9  obj_03 obj_10)
       (pred_9  obj_32 obj_28)
       (pred_9  obj_14 obj_15)
       (pred_9  obj_07 obj_28)
       (pred_10 obj_03 obj_19)
       (pred_10 obj_32 obj_26)
       (pred_10 obj_14 obj_24)
       (pred_10 obj_07 obj_31)
       (pred_7 obj_01)
    )

    (:goal (and
       (pred_10 obj_03 obj_12)
    ))
(:constraints
  (always (not (pred_7 obj_16)))
)
)

; plan
1. (op_3 obj_01 obj_06)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_06)
   goals met: 0 of 1
2. (op_3 obj_06 obj_18)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_18)
   goals met: 0 of 1
3. (op_3 obj_18 obj_19)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_19)
   goals met: 0 of 1
4. (op_5 obj_19 obj_03)
   deleted: (pred_10 obj_03 obj_19) (pred_1)
   added: (pred_8 obj_03)
   goals met: 0 of 1
5. (op_3 obj_19 obj_18)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_18)
   goals met: 0 of 1
6. (op_3 obj_18 obj_06)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_06)
   goals met: 0 of 1
7. (op_3 obj_06 obj_01)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_01)
   goals met: 0 of 1
8. (op_3 obj_01 obj_12)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_12)
   goals met: 0 of 1
9. (op_2 obj_12 obj_03)
   deleted: (pred_8 obj_03)
   added: (pred_1) (pred_10 obj_03 obj_12)
   goals met: 1 of 1
